ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_wpts.c
/******************************************************************************
* Function Name: Cy_BLE_WPTSS_ConfirmationEventHandler
***************************************************************************//**
*
*  Handles a Value Confirmation request event from the BLE stack.
*
*  *eventParam - The pointer to a structure of type cy_stc_ble_conn_handle_t.
*
******************************************************************************/
static void Cy_BLE_WPTSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    cy_en_ble_wpts_char_index_t locCharIndex;

    uint32_t locReqHandle = 0u;

    if((Cy_BLE_WPTS_ApplCallback != NULL) && (cy_ble_wptssReqHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locCharIndex = CY_BLE_WPTS_PRU_CONTROL; (locCharIndex < CY_BLE_WPTS_CHAR_COUNT) && (locReqHandle == 0u);
            locCharIndex++)
        {
            if(cy_ble_wptssReqHandle == cy_ble_wptsConfigPtr->wptss->charInfo[locCharIndex].charHandle)
            {
                /* Fill in event data and inform Application about successfully confirmed indication. */
                cy_stc_ble_wpts_char_value_t locCharValue =
                {
                    .connHandle = *eventParam,
                    .charIndex  = locCharIndex,
                    .value      = NULL
                };
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                cy_ble_wptssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                Cy_BLE_WPTS_ApplCallback((uint32_t)CY_BLE_EVT_WPTSS_INDICATION_CONFIRMED, &locCharValue);
                locReqHandle = 1u;
            }
        }
    }
}

#endif /* CY_BLE_WPTS_SERVER */


#ifdef CY_BLE_WPTS_CLIENT


/******************************************************************************
* Function Name: Cy_BLE_WPTSC_Discovery
***************************************************************************//**
*
*  This function discovers the PRU's WPT service and characteristics using the
*  GATT Primary Service Handle, received through the WPT Service Data
*  within the PRU advertisement payload, together with the handle offsets defined
*  A4WP specification.
*
*  The PTU may perform service discovery using the Cy_BLE_GATTC_StartDiscovery().
*  This function may be used in response to Service Changed indication or to
*  discover services other than the WPT service supported by the PRU.
*
*  \param servHandle: GATT Primary Service Handle of the WPT service.
*  \param connHandle: BLE peer device connection handle.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - All client instances are used. 
*    
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_WPTSC_Discovery(cy_ble_gatt_db_attr_handle_t servHandle,
                                              cy_stc_ble_conn_handle_t connHandle)
{
    uint32_t discIdx;
    cy_en_ble_api_result_t apiResult;
    
    apiResult = Cy_BLE_GATTC_AddConnHandle(connHandle);
    
    if(apiResult == CY_BLE_SUCCESS)
    {
        discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

        cy_ble_wptsc[discIdx].serviceHandle = servHandle;
        cy_ble_wptsc[discIdx].charInfo[CY_BLE_WPTS_PRU_CONTROL].valueHandle =
            servHandle + CY_BLE_WPTS_PRU_CONTROL_CHAR_VALUE_OFFSET;
        cy_ble_wptsc[discIdx].charInfo[CY_BLE_WPTS_PTU_STATIC_PAR].valueHandle =
            servHandle + CY_BLE_WPTS_PTU_STATIC_PAR_CHAR_VALUE_OFFSET;
        cy_ble_wptsc[discIdx].charInfo[CY_BLE_WPTS_PRU_ALERT].valueHandle =
            servHandle + CY_BLE_WPTS_PRU_ALERT_PAR_CHAR_VALUE_OFFSET;
        cy_ble_wptsc[discIdx].charInfo[CY_BLE_WPTS_PRU_ALERT].descrHandle[CY_BLE_WPTS_CCCD] =
            servHandle + CY_BLE_WPTS_PRU_ALERT_PAR_CHAR_CCCD_OFFSET;
        cy_ble_wptsc[discIdx].charInfo[CY_BLE_WPTS_PRU_STATIC_PAR].valueHandle =
            servHandle + CY_BLE_WPTS_PRU_STATIC_PAR_CHAR_VALUE_OFFSET;
        cy_ble_wptsc[discIdx].charInfo[CY_BLE_WPTS_PRU_DYNAMIC_PAR].valueHandle =
            servHandle + CY_BLE_WPTS_PRU_DYNAMIC_PAR_CHAR_VALUE_OFFSET;

        Cy_BLE_SetConnectionState(connHandle, CY_BLE_CONN_STATE_CLIENT_DISCOVERED);
    }
    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_WPTSC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP
*  event. Based on the service UUID, an appropriate data structure is populated
*  using the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*
******************************************************************************/
static void Cy_BLE_WPTSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo)
{
    static cy_ble_gatt_db_attr_handle_t *lastEndHandle[CY_BLE_CONFIG_GATTC_COUNT] = { NULL };
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);

    /* WPTS service has only characteristics with 128-bit UUIDs */
    if((discCharInfo->uuidFormat == CY_BLE_GATT_128_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_WPTS))
    {
        /* Update last characteristic endHandle to declaration handle of this characteristic */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = discCharInfo->charDeclHandle - 1u;
            lastEndHandle[discIdx] = NULL;
        }

        /* Compare common part of characteristics 128-bit UUID (except first byte) */
        if(memcmp(&cy_ble_wptscCharUuid128[CY_BLE_WPTS_PRU_CONTROL].value[1u],
                  &discCharInfo->uuid.uuid128.value[1u], CY_BLE_GATT_128_BIT_UUID_SIZE - 1u) == 0u)
        {
            /* Check the range of the first byte to be between the first and last characteristic */
            if((discCharInfo->uuid.uuid128.value[0u] >= cy_ble_wptscCharUuid128[CY_BLE_WPTS_PRU_CONTROL].value[0u]) &&
               (discCharInfo->uuid.uuid128.value[0u] <= cy_ble_wptscCharUuid128[CY_BLE_WPTS_CHAR_COUNT - 1u].value[0u]))
            {
                uint32_t locCharIndex;
                locCharIndex = (uint32_t)discCharInfo->uuid.uuid128.value[0u] -
                               cy_ble_wptscCharUuid128[CY_BLE_WPTS_PRU_CONTROL].value[0u];
                /* Verify that characteristic handler is not assigned already */
                if(cy_ble_wptsc[discIdx].charInfo[locCharIndex].valueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    cy_ble_wptsc[discIdx].charInfo[locCharIndex].valueHandle = discCharInfo->valueHandle;
                    cy_ble_wptsc[discIdx].charInfo[locCharIndex].properties = discCharInfo->properties;
                    lastEndHandle[discIdx] = &cy_ble_wptsc[discIdx].charInfo[locCharIndex].endHandle;
                }
                else
                {
                    Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DUPLICATION, &discCharInfo);
                }
            }
        }

